app/controllers/portfolios_controller.rb

  def update
    @portfolio_item = Portfolio.find(params[:id])

    if @portfolio_item.update(params.require(:portfolio).permit(:title, :subtitle, :body))
---
SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "portfolios" SET "subtitle" = $1, "body" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4